# LandmarkMatchSlope

## Description
Matches slope and contour angle information of a Landmark object to the specified 3D polygon.

```pascal
PROCEDURE LandmarkMatchSlope(
				h           : HANDLE;
				h3d         : HANDLE;
				landmarkObj : HANDLE);
```

```python
def vs.LandmarkMatchSlope(h, h3d, landmarkObj):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|   |
|h3d|HANDLE|   |
|landmarkObj|HANDLE|   |

## Version
Availability: from Vectorworks 2016

## Category
* Utility